components/perftest-capp/src/main/capp/DMPerfTest_xsltStyleSheet_1.0.0/resources/DMPerfTest_xsltStyleSheet.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><xsl:stylesheet xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:firstElementOfTheInput="soapenv:Envelope" xmlns:m="http://services.samples/xsd" xmlns:notXSLTCompatible="false" xmlns:own="http://ownfunction.org" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" extension-element-prefixes="xs own notXSLTCompatible firstElementOfTheInput" version="2.0"><xsl:function name="own:setPrecision"><xsl:param name="resultString"/><xsl:param name="noOfDigits"/><xsl:if test="$noOfDigits=0"><xsl:value-of select="$resultString"/></xsl:if><xsl:if test="$noOfDigits!=0"><xsl:value-of select="own:setPrecision(concat($resultString,'0'),$noOfDigits - 1)"/></xsl:if></xsl:function><xsl:template match="/"><soapenv:Envelope><soapenv:Header><routing><content><xsl:value-of select="soapenv:Envelope/soapenv:Header/routing/content"/></content></routing></soapenv:Header><soapenv:Body><m:buyStocks><xsl:for-each select="soapenv:Envelope/soapenv:Body/m:buyStocks/order"><order><symbol><xsl:value-of select="'XYZ'"/></symbol><buyerID><xsl:value-of select="buyerID"/></buyerID><price><xsl:value-of select="number( price )"/></price><volume><xsl:value-of select="number( volume )"/></volume></order></xsl:for-each></m:buyStocks></soapenv:Body></soapenv:Envelope></xsl:template></xsl:stylesheet>